


Network Working Group                                       M. Boucadair
Internet-Draft                                            France Telecom
Intended status: Standards Track                                R. Penno
Expires: November 8, 2010                               Juniper Networks
                                                                 D. Wing
                                                                   Cisco
                                                             May 7, 2010


        DHCP and DHCPv6 Options for Port Control Protocol (PCP)
                     draft-bpw-softwire-pcp-dhcp-00

Abstract

   This document specifies DHCP (IPv4 and IPv6) Options to convey the IP
   address or a FQDN of a PCP Server.  A dedicated option to prevent
   overloading PCP Servers is also specified.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on November 8, 2010.

Copyright Notice

   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Boucadair, et al.       Expires November 8, 2010                [Page 1]

Internet-Draft              PCP DHCP Options                    May 2010


   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Consistent NAT and PCP Configuration . . . . . . . . . . . . .  3
   3.  DHCPv6 Options . . . . . . . . . . . . . . . . . . . . . . . .  3
     3.1.  PCP Server Address DHCPv6 Option . . . . . . . . . . . . .  4
     3.2.  PCP Server FQDN DHCPv6 Option  . . . . . . . . . . . . . .  5
     3.3.  PCP Service Time Wait DHCPv6 Option  . . . . . . . . . . .  5
   4.  DHCP Option  . . . . . . . . . . . . . . . . . . . . . . . . .  7
     4.1.  PCP Server Address . . . . . . . . . . . . . . . . . . . .  7
     4.2.  PCP Server FQDN  . . . . . . . . . . . . . . . . . . . . .  8
     4.3.  PCP Service Time Wait DHCP Option  . . . . . . . . . . . .  8
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  9
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 10
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 10
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 10
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 10
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 11























Boucadair, et al.       Expires November 8, 2010                [Page 2]

Internet-Draft              PCP DHCP Options                    May 2010


1.  Introduction

   [I-D.wing-softwire-port-control-protocol] recommends the use of DHCP
   as one of the mechanisms to discover a PCP Server.  To that aim, this
   document defines DHCP [RFC2131] and DHCPv6 [RFC3315] Options which
   can be used to provision a PCP Server to a PCP Client.  The use of
   DHCP or DHCPv6 depends on the PCP deployment scenarios.

   For flexibility reasons, this document defines both IP address and
   FQDN Options.  It is up to the Service Providers to decide which
   option is convenient for them according to their engineering
   policies.

   This document does not make any assumption on the IP address to be
   conveyed in a DHCP/DHCPv6 Option.  In particular, this document does
   not prevent Service Providers to use the IANA-to-be-assigned IP
   address [I-D.wing-softwire-port-control-protocol] to be conveyed in
   DHCP/DHCPv6 Options.


2.  Consistent NAT and PCP Configuration

   The PCP Server discovered through DHCP MUST be able to install
   mappings on the NAT that will be crossed by packets issued by the
   host or any terminal belonging to the same realm (e.g., DHCP client
   is embedded in a CP router).  If DHCP is used to provision a PCP
   Server, Service Providers SHOULD configure appropriately their DHCP
   servers to meet this requirement.  In case this per-requisite is not
   met, customers would experience service troubles and their service(s)
   won't be delivered appropriately.

   Note that this constraint is implicitly met in scenarios where only
   one single PCP-controlled device is deployed in the network.


3.  DHCPv6 Options

   Two DHCPv6 Options defined in the following sub-sections are used to
   discover the identity of a PCP Server.  The first option can be used
   to include an IPv6 address or an IPv4-mapped IPv6 address ( See
   Section 3.1 of [I-D.wing-behave-dns64-config]).  While the second
   option is used to include a domain name to be used to retrieve the IP
   address of the PCP Server.

   For example, in the context of DS-Lite architecture
   [I-D.ietf-softwire-dual-stack-lite] DHCPv6 can be used to include the
   IPv4-mapped IPv6 address [RFC2373] of a PCP Server (should be
   interpreted as an IPv4 address), and in the case of NAT64



Boucadair, et al.       Expires November 8, 2010                [Page 3]

Internet-Draft              PCP DHCP Options                    May 2010


   [I-D.ietf-behave-v6v4-xlate-stateful] to provision the IPv6 address
   of the PCP Server.

   If OPTION_PCP_SERVER_D is used to configure the PCP Server, the
   client MUST issue a AAAA DNS query to resolve an IPv6 address, if the
   query has failed the PCP Client MUST issue an A DNS query.  [[Note:
   In order to avoid the delay, a field can be added to the option to
   inform the client about the type of the DNS query to be issued]]].

   OPTION_PCP_SERVER_D and OPTION_PCP_SERVER_A DHCPv6 option MUST be
   supported.  OPTION_PCP_SERVICE_T DHPCv6 option MAY (SHOULD?) be
   supported.

3.1.  PCP Server Address DHCPv6 Option

   This option specifies an IP address of the PCP Server to be used by
   the PCP Client to send its PCP messages.

       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVER_A      |           option-len          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |                   PCP Server (IP address)                     |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |                   PCP Server (IP address)                     |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                                ....                           :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


               Figure 1: PCP Server IP Address DHCPv6 Option

   The description of the fields of the option shown in Figure 1 is
   described below:

   o  Option-code: OPTION_PCP_SERVER_A (TBA, see Section 6)

   o  Option-length: MUST be a multiple of 16.





Boucadair, et al.       Expires November 8, 2010                [Page 4]

Internet-Draft              PCP DHCP Options                    May 2010


   o  PCP Server: One or a list of IP address(es) of PCP Server(s) to be
      used by a PCP Client.  In particular, IPv4-mapped IPv6 addresses
      can be included in this field when the PCP Server is reachable
      over IPv4 (e.g., DS-Lite).

   If several IP addresses are included in the option, these addresses
   MUST be listed in the preference order.  A client MUST use a
   reachable address with higher preference order.

   In case several addresses are to be conveyed in a DHCPv6 option, it
   is RECOMMENDED to use OPTION_PCP_SERVER_D DHCPv6 option.

3.2.  PCP Server FQDN DHCPv6 Option

   This option includes a FQDN of the PCP Server to be used by the PCP
   Client.  In order to exploit this option, this document assumes that
   a DNS server is configured on the host client by DHCP or other means.

       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVER_D      |         Option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      :                    PCP Server Domain Name                     :
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                  Figure 2: PCP Server FQDN DHCPv6 Option

   The description of the fields of the option shown in Figure 2 is
   described below:

   o  Option-code: OPTION_PCP_SERVER_D (TBA, see Section 6)

   o  Option-length: Length of the 'PCP Server Domain Name' field in
      octets.  This length is variable.

   o  PCP Server Domain Name: The domain name of the PCP Server to be
      used by the PCP Client.  The domain name is encoded as specified
      in [RFC3315].

3.3.  PCP Service Time Wait DHCPv6 Option

   [NOTE: This section will be removed if the avalanche restart concern
   is handled by a generic initiative such as HomeGate.  See for example
   [RFC3435] how this issue is covered for MGCP.]

   In order to avoid overload phenomena (e.g., power outage event in a



Boucadair, et al.       Expires November 8, 2010                [Page 5]

Internet-Draft              PCP DHCP Options                    May 2010


   big city), the following option (Figure 3) is used to ask a PCP
   Client to wait N seconds before sending its first PCP message.  If no
   overload control mechanism is supported, avalanche restart phenomena
   would lead to a huge amount of requests to the PCP Server which would
   impact the serviceability of the PCP-controlled device and even would
   induce a service outage for a large number of customers serviced by
   the same CGN device.  Distributing all PCP requests in a random or a
   pre-defined manner will avoid experiencing load bursts.

   This option SHOULD be used only with a non-null TimeWait value.

   The format of the OPTION_PCP_SERVICE_T option is shown in Figure 3.

       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_PCP_SERVICE_T     |         Option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |            Method             |          TimeWait             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   This option can be generalised to all service by including a field
   which specifies the associated service (e.g., SIP, PCP, NTP, etc.)

               Figure 3: PCP Service TimeWait DHCPv6 Option

   The description of the fields of this option is as follows:

   o  Option-code: OPTION_PCP_SERVICE_T (TBA, see Section 6)

   o  Option-length: 4.

   o  Method: This field specifies the method to apply on the TimeWait.
      Two methods MUST be supported by any OPTION_PCP_SERVICE_T
      implementation:

         0: Basic.  When this method is used, the PCP Client MUST wait
         until the expiry of TimeWait seconds before issuing a PCP
         message.

         1: Random: When this method is indicated, a RAND() function
         MUST be used to generate a value between 0 and TimeWait.  The
         PCP Client MUST wait until the expiry of the generated value
         before issuing a PCP message to a PCP Server.

   o  TimeWait: This field specifies a number of seconds to be used when
      applying the function indicated in the Method field.




Boucadair, et al.       Expires November 8, 2010                [Page 6]

Internet-Draft              PCP DHCP Options                    May 2010


4.  DHCP Option

   The PCP Server DHCP Option can be used to configure an IPv4 address
   or a DNS FQDN to be used by the PCP Client to contact a PCP Server.

   Two encodings are defined as specified by the encoding byte ('enc').

   1.  If the encoding byte has the value 0, it is followed by one or
       several IPv4 address(es).

   2.  If the encoding byte has the value 1, it is followed by a domain
       name.

   3.  if the encoding byte has the value 2, it is followed by a integer
       which indicates a number of seconds to wait before issuing a PCP
       message.

   Both 0 and 1 encoding values MUST be supported.  Encoding value 2 MAY
   be supported.  An option with an encoding value of 2 MAY be jointly
   included in the same DHCP message carrying an option with an encoding
   of 0 or 1.  When an FQDN encoding is used, the client MUST issue A
   DNS queries to retrieve an IPv4 address.

4.1.  PCP Server Address

   This option specifies one or a list of IPv4 addresses of the PCP
   Server to be used by the PCP Client to send its PCP messages.

          Code   Len  PCP Server IP Address         PCP Server IP Address
         +-----+-----+-----+-----+-----+-----+-----+-----+-----+--
         | TBA |  n  |  0  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 | ...
         +-----+-----+-----+-----+-----+-----+-----+-----+-----+--


                Figure 4: PCP Server IP Address DHCP Option

   The description of the fields of the option shown in Figure 4 is
   described below:

   o  Code: OPTION_PCP_SERVER (TBA, see Section 6)

   o  Len: Must be a multiple of 4.

   o  Enc: Must be set to 0.

   o  PCP Server: contains one or several IPv4 addresses of a PCP Server
      to be used by a PCP Client.  If several addresses are included,
      they are included in the preference order.  A client MUST use the



Boucadair, et al.       Expires November 8, 2010                [Page 7]

Internet-Draft              PCP DHCP Options                    May 2010


      reachable address with the highest preference order.  Instead of
      including several addresses in the DHCP option, it is RECOMMENDED
      to use a FQDN encoding.

4.2.  PCP Server FQDN

   This option includes a FQDN of the PCP Server to be used by the PCP
   Client to send its PCP messages.  In order to exploit this option,
   this document assumes that a DNS server is configured on the host
   client by DHCP or other means.

           Code  Len   Enc   FQDN of PCP Server
         +-----+-----+-----+-----+-----+-----+-----+-----+--
         | TBA |  n  |  1  |  s1 |  s2 |  s3 |  s4 | s5  |  ...
         +-----+-----+-----+-----+-----+-----+-----+-----+--


                   Figure 5: PCP Server FQDN DHCP Option

   The description of the fields of the option shown in Figure 5 is
   described below:

   o  Code: OPTION_PCP_SERVER (TBA, see Section 6)

   o  Len: Length of the "PCP Server Domain Name" field in octets.  This
      length is variable.

   o  Enc: Must be set to 1.

   o  PCP Server Domain Name: The domain name of the PCP Server to be
      used by the PCP Client.  The encoding of domain name is described
      in [RFC2131].

4.3.  PCP Service Time Wait DHCP Option

   [NOTE: This section will be removed if the avalanche restart concern
   is handled by a generic initiative such as HomeGate]

   This option is used to indicate to a host, the time to wait before
   issuing a PCP message.  The purpose of this option is to prevent
   overload phenomena.  This option SHOULD be used only with a non-null
   TimeWait value.

   The format of the PCP Service Time Wait DHCP Option is shown in
   Figure 6.






Boucadair, et al.       Expires November 8, 2010                [Page 8]

Internet-Draft              PCP DHCP Options                    May 2010


           Code  Len   Enc  Method TimeWait
         +-----+-----+-----+-----+-----+-----+
         | TBA |  3  |  2  |  M  |  TimeWait |
         +-----+-----+-----+-----+-----+-----+


                Figure 6: PCP Service TimeWait DHCP Option

   The description of the fields of this option is as follows:

   o  Code: OPTION_PCP_SERVER (TBA, see Section 6)

   o  Len: 3.

   o  Enc: Must be set to 2.

   o  Method: This field specifies the method to apply on the TimeWait.
      Two methods MUST be supported:

         0: Basic.  When this method is indicated, the PCP Client MUST
         wait until the expiry of TimeWait seconds before issuing a PCP
         message.

         1: Random: When this method is indicated, a RAND() function
         MUST be used to generate a value between 0 and TimeWait.  The
         PCP Client MUST wait until the expiry of the generated value
         before issuing a PCP message to a PCP Server.

   o  TimeWait: This field specifies a number of seconds to be used when
      applying the function indicated in the Method field.


5.  Security Considerations

   The security considerations in [RFC2131], [RFC3315] and
   [I-D.wing-softwire-port-control-protocol] are to be considered.


6.  IANA Considerations

   This document request two DHCPv6 Option codes and one DHCP Option
   code.

   DHCPv6 Option codes:

   1.  OPTION_PCP_SERVER_A





Boucadair, et al.       Expires November 8, 2010                [Page 9]

Internet-Draft              PCP DHCP Options                    May 2010


   2.  OPTION_PCP_SERVER_D

   3.  OPTION_PCP_SERVICE_T

   DHCP Option code:

   1.  OPTION_PCP_SERVER


7.  Acknowledgements

   TBC


8.  References

8.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2131]  Droms, R., "Dynamic Host Configuration Protocol",
              RFC 2131, March 1997.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

8.2.  Informative References

   [I-D.ietf-behave-v6v4-xlate-stateful]
              Bagnulo, M., Matthews, P., and I. Beijnum, "Stateful
              NAT64: Network Address and Protocol Translation from IPv6
              Clients to IPv4 Servers",
              draft-ietf-behave-v6v4-xlate-stateful-11 (work in
              progress), March 2010.

   [I-D.ietf-softwire-dual-stack-lite]
              Durand, A., Droms, R., Haberman, B., Woodyatt, J., Lee,
              Y., and R. Bush, "Dual-Stack Lite Broadband Deployments
              Following IPv4 Exhaustion",
              draft-ietf-softwire-dual-stack-lite-04 (work in progress),
              March 2010.

   [I-D.wing-behave-dns64-config]
              Wing, D., "DNS64 Resolvers and Dual-Stack Hosts",
              draft-wing-behave-dns64-config-02 (work in progress),
              February 2010.



Boucadair, et al.       Expires November 8, 2010               [Page 10]

Internet-Draft              PCP DHCP Options                    May 2010


   [I-D.wing-softwire-port-control-protocol]
              Wing, D., Penno, R., and M. Boucadair, "Port Control
              Protocol (PCP)",
              draft-wing-softwire-port-control-protocol-01 (work in
              progress), March 2010.

   [RFC2373]  Hinden, R. and S. Deering, "IP Version 6 Addressing
              Architecture", RFC 2373, July 1998.

   [RFC3435]  Andreasen, F. and B. Foster, "Media Gateway Control
              Protocol (MGCP) Version 1.0", RFC 3435, January 2003.


Authors' Addresses

   Mohamed Boucadair
   France Telecom
   Rennes,   35000
   France

   Email: mohamed.boucadair@orange-ftgroup.com


   Reinaldo Penno
   Juniper Networks
   1194 N Mathilda Avenue
   Sunnyvale, California  94089
   USA

   Email: rpenno@juniper.net


   Dan Wing
   Cisco Systems, Inc.
   170 West Tasman Drive
   San Jose, California  95134
   USA

   Email: dwing@cisco.com












Boucadair, et al.       Expires November 8, 2010               [Page 11]


